tap 'homebrew/cask'
tap 'homebrew/cask-fonts'

brew 'coreutils'
brew 'gpg'
brew 'automake'
brew 'autoconf'
brew 'openssl'
brew 'libyaml'
brew 'readline'
brew 'libxslt'
brew 'libtool'
brew 'unixodbc'
brew 'unzip'
brew 'curl'
brew 'jq'
brew 'tmux'
brew 'asdf'
brew 'autojump'
cask 'visual-studio-code'
cask 'spotify'
brew 'vim'
cask 'flux'
cask 'docker'
brew 'zsh'
brew 'zsh-completions'
cask 'google-chrome'
cask 'font-fira-code'
cask 'rectangle'
cask 'notion'
cask 'alfred'
cask 'iterm2'
brew 'the_silver_searcher'
brew 'fpp'
brew 'reattach-to-user-namespace'
brew 'tldr'
brew 'gh'
brew 'urlview'

brew 'mas' # Mac App Store manager
mas 'Todoist: To-Do List & Tasks', id: 585829637
mas 'Be Focused - Focus Timer', id: 973134470
