
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'

brew 'coreutils'
brew 'gpg'
brew 'automake'
brew 'autoconf'
brew 'openssl'
brew 'libyaml'
brew 'readline'
brew 'libxslt'
brew 'libtool'
brew 'unixodbc'
brew 'unzip'
brew 'git'
brew 'curl'
brew 'jq'
brew 'tmux'
brew 'asdf'
brew 'autojump'
cask 'visual-studio-code'
cask 'spotify'
brew 'neovim'
brew 'zsh'
cask 'font-fira-code'
cask 'rectangle'
cask 'notion'
cask 'alfred'
cask 'alacritty'
cask 'dropbox'
cask 'bitwarden'
brew 'the_silver_searcher'
brew 'fpp'
brew 'reattach-to-user-namespace'
brew 'tldr'
brew 'gh'
brew 'urlview'
brew 'docker'
brew 'docker-compose'
brew 'minikube'
brew 'starship'
brew 'chezmoi'
brew 'exa'
brew 'tmuxinator'
brew 'bat'
brew 'git-delta'
cask 'todoist'
brew 'mas' # Mac App Store manager

