# tap "homebrew/bundle"
# tap "homebrew/cask-fonts"
brew 'atuin'
brew 'bat'
brew 'tmuxinator'
brew 'starship'
brew 'urlview'
brew 'tldr'
brew 'fpp'
brew 'fzf'
brew 'the_silver_searcher'
brew 'zsh'
brew 'neovim'
brew 'autojump'
brew 'tmux'
brew 'jq'
brew 'curl'
brew 'git'
brew 'git-town'
brew 'git-delta'
brew 'gitui'
brew 'unzip'
brew 'progress'
brew 'btop'
brew 'redis'
brew 'gh'
brew 'fastfetch'
brew 'asdf'
brew 'chezmoi'

# Only on macOS

{{ if eq .chezmoi.os "darwin" }}
tap 'cooklang/tap'
brew 'mas' # Mac App Store manager
brew 'unixodbc'
brew 'libtool'
brew 'libxslt'
brew 'readline'
brew 'libyaml'
brew 'openssl'
brew 'autoconf'
brew 'automake'
brew 'gpg'
brew 'coreutils'
brew 'minikube'
brew 'docker-compose'
brew 'docker'
brew 'reattach-to-user-namespace'
brew 'cooklang/tap/cookcli'
cask 'todoist'
cask 'ghostty'
cask 'raycast'
cask 'rectangle'
cask 'obsidian'
cask 'spotify'
cask 'visual-studio-code'
cask 'font-fira-code'
cask 'bitwarden'
cask 'keymapp'
vscode "eamodio.gitlens"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "kaiwood.endwise"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "redhat.vscode-yaml"
vscode "shopify.ruby-lsp"
vscode "sissel.shopify-liquid"
vscode "vscodevim.vim"
vscode "will-wow.vscode-alternate-file"
vscode "editorconfig.editorconfig"
{{ end }}
